# SheetCurrentRevisionDescription Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SheetCurrentRevisionDescription Property
ParameterTypeId Class See Also
---
"Current Revision Description"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SheetCurrentRevisionDescription { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SheetCurrentRevisionDescription As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SheetCurrentRevisionDescription {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace